/asda/g; // шукає ці букви
/[^gvn]egan/g // - знаходить негативні співпадіння
/[gvn]/g // -шукає букви в діапазоні
/[a-z]/gi // A-Z
/[0-9]/g
// go-vegan-began-regan-megan

/[0-9]+/g // безліч
/[0-9]+{9}/g // рівно 9 чисел
/[0-9]+{9,12}/g // рівно 12 чисел
/[0-9]+{9,}/g // 9 і більше
/\d{9,}/g // шукає всі числа \d // \D всі символи

/\s/g // всі пробіли \s // \S всі не відступи (числа, символи)
/\w/g // всіііі символи окрім табуляції
/./g // визначає все окрім перенесення на другий рядок


/\w{5}\s\d{3}/g

// hello 123

/he?llo?/g // останню літеру шукаємо або ні(опційна літера)

/^hello$/g// починаються на h а закінчуєтсья на o(шукає саме слово а не співпадіння)


/p|s/g // співпадіння на p або на s

/(p|s).com/g

/\[a-z]+/g


// регулярний вирази для пошти

/^[a-z0-9]+@[a-z]+\.[a-z]{2,3}/g

//  test@gmail.com


